tap "adoptopenjdk/openjdk"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
# Manage your Java environment
brew "jenv"
# Run local Kubernetes cluster in Docker
brew "kind"
# Java-based project management
brew "maven"
# Run a Kubernetes cluster locally
brew "minikube"
# AdoptOpenJDK OpenJDK (Java) Development Kit
cask "adoptopenjdk11"
# AdoptOpenJDK OpenJDK (Java) Development Kit
cask "adoptopenjdk8"
# Web browser focusing on privacy
cask "brave-browser"
# Clipboard extension app
cask "clipy"
# Universal database tool and SQL client
cask "dbeaver-community"
# App to build and share containerized applications and microservices
cask "docker"
# IDE for Java development - community edition
cask "intellij-idea-ce"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Collaboration platform for API development
cask "postman"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Text editor for code, markup and prose
cask "sublime-text"
# Unpacks archive files
cask "the-unarchiver"
# All-in-One Java Troubleshooting Tool
cask "visualvm"
