tap "adoptopenjdk/openjdk"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "int128/kubelogin"
tap "spring-io/tap"
# Platform built on V8 to build network applications
brew "node"
# CLI tool for Angular
brew "angular-cli"
# Command-line interface for SQLite
brew "sqlite"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Official Amazon AWS command-line interface
brew "awscli"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Tool for exploring each layer in a docker image
brew "dive"
# Isolated development environments using Docker
brew "docker-compose"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Validating, recursive, caching DNS resolver
brew "unbound"
# Go version management
brew "goenv"
# OpenType text shaping engine
brew "harfbuzz"
# Development kit for the Java programming language
brew "openjdk"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Kubernetes package manager
brew "helm"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Manage your Java environment
brew "jenv"
# Load testing and performance measurement application
brew "jmeter"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Little helper to run CNCF's k3s in Docker
brew "k3d"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Run local Kubernetes cluster in Docker
brew "kind"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Package manager for kubectl plugins
brew "krew"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Kyma command-line interface
brew "kyma-cli"
# Mac App Store command-line interface
brew "mas"
# Java-based project management
brew "maven"
# Run a Kubernetes cluster locally
brew "minikube"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Manage multiple Node.js versions
brew "nvm"
# Show ps output as a tree
brew "pstree"
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Generic machine emulator and virtualizer
brew "qemu"
# File browser
brew "ranger"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Tail multiple Kubernetes pods & their containers
brew "stern"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# UNIX shell (command interpreter)
brew "zsh"
# Packer
brew "hashicorp/tap/packer"
# Terraform
brew "hashicorp/tap/terraform"
# A kubectl plugin for Kubernetes OpenID Connect authentication
brew "int128/kubelogin/kubelogin"
brew "spring-io/tap/spring-boot"
# Data management tool that enables working with SQL Server
cask "azure-data-studio"
# Virtual Audio Driver
cask "blackhole-16ch"
# Web browser focusing on privacy
cask "brave-browser"
# E-books management software
cask "calibre"
# Clipboard extension app
cask "clipy"
# Universal database tool and SQL client
cask "dbeaver-community"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
# Web browser
cask "google-chrome"
# IDE for Java development - community edition
cask "intellij-idea-ce"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Screen and video recording software
cask "loom"
# Explorer for Azure Storage
cask "microsoft-azure-storage-explorer"
# Remote desktop client
cask "microsoft-remote-desktop"
# Interactive tool for analyzing MongoDB data
cask "mongodb-compass"
# Orchestrates virtual Ubuntu instances
cask "multipass"
# App to write, plan, collaborate, and get organized
cask "notion"
# Open-source software for live streaming and screen recording
cask "obs"
# Client program for the OpenVPN Access Server
cask "openvpn-connect"
# Administration and development platform for PostgreSQL
cask "pgadmin4"
# Pomodoro timer
cask "pomatez"
# Collaboration platform for API development
cask "postman"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Text editor for code, markup and prose
cask "sublime-text"
# Native GUI tool for relational databases
cask "tableplus"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin11"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin17"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin8"
# Unpacks archive files
cask "the-unarchiver"
# Free and open-source OpenVPN client
cask "tunnelblick"
# Virtual machines UI using QEMU
cask "utm"
# Development environment
cask "vagrant"
cask "vagrant-manager"
# RSS and Atom reader
cask "vienna"
# Open-source code editor
cask "visual-studio-code"
# All-in-One Java Troubleshooting Tool
cask "visualvm"
# Multimedia player
cask "vlc"
# Video communication and virtual meeting platform
cask "zoom"
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
vscode "DavidAnson.vscode-markdownlint"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "scala-lang.scala"
vscode "scalameta.metals"
